<!--
 * @Descripttion: 
 * @version: 
 * @Author: wanglong
 * @Date: 2021-08-16 17:20:06
 * @LastEditors: wanglong
 * @LastEditTime: 2021-08-18 15:19:30
 * @* : 博虹出品，抄袭必究😄
-->
<template>
  <div class="agreement">
    <div class="close">
      <van-icon name="cross" size="0.7em" @click="close" />
    </div>
    <div class="content">
      <div class="box">
        <h3>观山湖区妇幼保健院预约平台用户注册协议</h3>
        <p>
          尊敬的用户，在您注册成为观山湖区妇幼保健院预约平台用户时，请您仔细阅读该注册协议，如果您对本注册协议中所阐述的内容有所异议，您可以放弃注册成为观山湖区妇幼保健院预约平台用户，若您注册成为了观山湖区妇幼保健院预约平台用户，则意味着您愿意遵守以下规定，同意观山湖区妇幼保健院预约平台对您在平台的行为进行监督管理:
        </p>
        <h5>提示条款</h5>
        <p>1、本协议中的平台是指观山湖区妇幼保健院移动终端预约平台。</p>
        <p>
          2、本注册协议用于规范移动终端的使用者（以下简称:用户）之间的行为和关系，保护用户和平台双方的合法权益。
        </p>
        <p>
          3、观山湖区妇幼保健院预约平台用户注册采用实名制，只有实名制注册平台用户，才可以使用已开放及后续开放的功能与服务。您在观山湖区妇幼保健院预约平台使用过程中填写的信息(包括姓名、电话、身份证号、诊疗卡预约信息单中的基本资料等)，必须准确、真实、有效，观山湖区妇幼保健院预约平台有责任保证您的隐私信息安全不泄露。
        </p>
        <p>
          4、平台在此特别提醒您，在您使用注册前请仔细阅读本协议，如果您对本协议的任何条款或者将来随时可能修改、补充的条款有异议，您可选择不注册或注销成为本平台的用户。
        </p>
        <p>
          5、用户在平台挂号、缴费、搜索、查询或使用其他关联服务等，即代表用户已经同意本注册协议。
          本注册条款适用于平台提供的各种服务，但当您使用平台某一特定服务时，如该服务另有单独的服务条款、指引或规则，您应遵守本注册条款及平台随时公布的与该服务相关的服务条款、指引或规则等。前述所有的指引和规则，均构成本注册条款的一部分。除非本注册条款另有其他明示规定，新推出的服务、增加或强化目前本服务的任何新功能，均受到本注册条款之规范。
        </p>
        <p>
          6、平台所提供的服务将完全按照其发布的章程、服务条款和操作规则严格执行。用户选择完全同意所有注册条款并完成注册程序，即能成为平台的正式用户。
        </p>
        <p>
          7、本平台有权在必要时修改本协议条款，协议条款一旦发生变动，届时将在用户界面提示修改内容，如果用户不同意所作的修改，可以主动取消获得的平台服务，进行注销。如果用户继续使用平台提供的服务，则将被视为接受注册条款变动。当发生有关争议时，以最新的注册协议为准。
        </p>
        <h5>用户管理条款</h5>
        <P
          >1、用户应自觉遵守注册协议中对网络服务的规定、程序和惯例。在使用平台过程中不发布任何带有非法、强扰、中伤他人、辱骂、伤害、庸俗、淫秽等刺激性文字，不传输任何有违法律规定的资料。</P
        >
        <p>
          2、对平台而言，用户账号信息是唯一验证用户真实信息的依据，只要使用了正确的用户账号信息无论是谁登陆均视为已经得到注册用户本人的授权。用户注册成功后，须保护好自己的帐号信息，因用户本人泄露而造成的任何损失由用户本人负责。
        </p>
        <p>
          3、如果为了向用户提供服务而需要将用户的信息共享至第三方，平台将评估该第三方收集信息的合法性、正当性、必要性。平台将要求第三方对用户的信息采取保护措施并且严格遵守相关法律法规与监管要求。另外，平台会按照法律法规及国家标准的要求以确认协议、具体场景下的文案确认、弹窗提示等形式征得用户的同意或确认第三方已经征得用户的同意。
        </p>
        <p>
          4、用户若在平台上散布、传播反动、色情或其他违反国家法律的信息，平台的系统记录有可能作为用户违反法律的证据，平台有权终止本平台的相关服务。此外，平台不对用户使用平台的用途和目的承担任何责任。
        </p>
        <p>
          5、在用户主动注销账号时，平台将根据相关法律法规的要求尽快使其匿名或删除用户的个人信息。
        </p>
        <h5>免责声明</h5>
        <p>
          1、鉴于网络服务的特殊性，平台有权随时变更、中断或终止部分或全部的平台服务。
        </p>
        <p>
          2、平台需要定期或不定期地对提供服务的相关设备进行检修或者维护，如因此类情况而造成服务在合理时间内的中断，平台无需为此承担任何责任，但平台应尽可能事先进行通告。
        </p>
        <p>
          3、若用户对因"用户提供资料不真实"而中断或者终止服务不满，用户可通过平台的申诉途径与平台取得联系并修正个人资料经平台核实后恢复账号使用。
        </p>
        <p>
          4、用户一旦注册成功，成为平台的合法用户，用户权限(用户信息)只允许用户本人使用，用户不应将其帐号信息转让、出借或给予他人使用。每个用户都要对其以帐号信息进行的所有活动和事件负全责。您有权随时更改您的帐号信息。若发现任何非法使用用户帐号或存在安全漏洞的情况，请立即通知服务提供方。因黑客行为或用户的保管疏忽等情况导致账号信息遭他人非法使用，平台不承担责任。
        </p>
        <p>
          5、因为优质医疗资源的稀缺，医院每日的接诊能力有限，所以平台无法承诺所有用户都能随时预约到观山湖区妇幼保健院指定的专家号，请您能谅解并尽量做到提前预约。
        </p>
        <p>
          6、用户预约是否成功请以预约平台发出的通知消息为准，若因信息故障而导致消息发送不成功或延迟，平台不负责任。
        </p>
        <p>
          7、您在就诊时请务必携带本人的身份证、诊疗卡及医保卡前往就诊，否则在就诊时您提供的信息与观山湖区妇幼保健院预约平台预约时提供的信息不一致，而造成工作人员对您的身份真实性存疑导致您挂号不成功，观山湖区妇幼保健院预约平台不予承担责任，一切后果用户自负。
        </p>
        <p>
          8、为了充分运用医疗资源，防止恶意约号或用户随意爽约造成号源浪费，观山湖区妇幼保健院预约平台会对用户近期内的预约行为进行判定，若您经常爽约或被系统判断有恶意约号行为，观山湖区妇幼保健院预约平台有权取消用户已经预约的号源，并冻结用户的账号。
        </p>
        <p>
          9、用户成功“预约挂号”后，若因特殊情况无法按时就诊的，为了避免专家门诊资源的浪费，用户可以在观山湖区妇幼保健院预约平台提示的时间内，通过电话或在站内取消预约。如果用户没有在规定的时间内取消预约，预约当天又没到医院就诊，将被视为爽约行为，观山湖区妇幼保健院预约平台有权追究其责任。
        </p>
        <p>
          10、为了更好的维护医院就诊秩序，请您按照预约时提示的候诊时间到医院候诊，若您迟到，医院有权另行安排就诊或取消本次就诊，观山湖区妇幼保健院预约平台不予承担任何责任。
        </p>
        <p>
          11、鉴于医生的临床工作具有很强的特珠性，医生在遇到抢救、急诊等特殊情况时，有可能会延后甚至取消门诊。观山湖区妇幼保健院预约平台在获知这种特殊情况后会将消息在第一时间内通知您，医生重新出诊的时间请用户留意医院当日公布的出诊日期。在此特殊情况下，用户产生的交通、餐饮、住宿等费用;或因门诊延期而导致病情延误等其他问题，预约平台、医生、医院不予负责。
        </p>
        <p>
          12、观山湖区妇幼保健院预约平台为用户提供的咨询服务，因为医生并没有与用户面诊交流，对用户的病情可能无法全面了解，所以观山湖区妇幼保健院预约平台对医生言论的严谨性、科学性不予保证，医生的言论仅供用户参考，具体的诊疗请用户务必到医院找医生进行面诊。若用户单一的听从医生言论，私自用药，出现的任何情况，一切后果用户自负。
        </p>
        <h5>隐私制度</h5>
        <p>
          1、保护您隐私是平台的一项基本原则，平台保证不对外公开或向第三方提供您的注册资料及您在使用网络服务时存储在平台的非公开内容，但下列情况除外:
        </p>
        <div>
          <p>（1）事先获得您的明确授权;</p>
          <p>（2）根据有关的法律法规要求;</p>
          <p>（3）按照相关政府主管部门的要求;</p>
          <p>（4）为维护社会公众的利益;</p>
          <p>（5）为维护预约平台的合法权益。</p>
        </div>

        <p>
          2、平台可能会与第三方合作向您提供相关的健康增值服务，在此情况下，如该第三方同意承担与预约平台同等的保护您隐私的责任，您同意并授权预约平台将您的注册资料等提供给该第三方。
        </p>
        <h5>信息使用:</h5>
        <p>
          1、观山湖区妇幼保健院移动预约平台不会向任何人出售或出借用户的个人信息，除非事先得到用户的许可。
        </p>
        <p>
          2、观山湖区妇幼保健院移动预约平台亦不允许任何第三方以任何手段收集、编辑、出售或者无偿传播用户的个人信息。任何用户如从事上述活动，一经发现，观山湖区妇幼保健院移动预约平台有权立即终止与该用户的服务协议，查封其账号。
        </p>
        <p>
          3、为服务用户的目的，观山湖区妇幼保健院移动预约平台可能通过使用用户的个人信息，向用户提供服务，包括但不限于向用户发出服务信息，或者与观山湖区妇幼保健院移动预约平台合作伙伴共享信息以便他们向用户发送有关其产品和服务的信息(后者需要用户的事先同意)。
        </p>
        <h5>信息披露:</h5>
        <p>有法律许可要求或服务提供方在诚信的基础上，可以披露以下信息:</p>
        <div>
          <p>(1)事先获得用户的明确授权;</p>
          <p>
            (2)如有符合资格的知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能的权利纠纷。
          </p>
          <p>
            (3)根据法律有关规定，或者行政、司法机构的要求，向第三方或者行政、司法机构披露。
          </p>
          <p>
            (4)如果用户出现违反中国有关法律或者平台政策的情况，需要向第三方披露。
          </p>
          <p>
            (5)为提供用户所要求的产品和服务，而必须和第三方分享用户的个人信息。
          </p>
          <p>(6)不可抗力所导致的用户信息公开;</p>
          <p>(7)由于本平台的硬件和软件的能力限制，所导致用户信息的公开。</p>
        </div>
        <h5>知识产权保护</h5>
        <p>
          1、观山湖区妇幼保健院的Logo、“观山湖区妇幼保健院”等文字、图形及其组合，以及观山湖区妇幼保健院的其他标识、徽记等为观山湖区妇幼保健院在中国和其他国家的注册商标。未经观山湖区妇幼保健院书面授权,任何人不得以任何方式展示、使用或做其他处理（包括但不限于复制、传播、展示、镜像、上传、下载)，也不得向他人表明您有权展示、使用或做其他处理。
        </p>
        <p>
          2、观山湖区妇幼保健院所有的产品、服务、技术与所有程序(以下或简称“技术服务”)的知识产权均归属于观山湖区妇幼保健院或归其权利人所有。
        </p>
        <p>
          3、除非平台另行声明，平台拥有观山湖区妇幼保健院在平台内发布文档等信息(包括但不限于文字、图形、图片、照片、音频、视频、图标、色彩、版面设计、电子文档)的所有权利(包括但不限于版权商标权、专利权、商业秘密和其他所有相关权利)。未经平台许可，任何人不得擅自使用如上内容(包括但不限于通过程序或设备监视、复制、转播、展示、镜像、上传、下载平台内的任何内容)。被授权浏览、复制、打印和传播属于平台内信息内容的，该等内容都不得用于商业目的且所有信息内容及其任何部分的使用都必须包括此权利声明。
        </p>
        <h5>法律适用及争议解决</h5>
        <p>
          本服务条款之效力和解释均适用中华人民共和国之法律。如服务条款之任何一部分与中华人民共和国法律相抵触，则该部分条款应按法律规定重新解释，部分条款之无效或重新解释不影响其它条款之法律效力。因使用本平台过程中发生争议的，任何一方均有权向观山湖区妇幼保健院所在地人民法院提起诉讼。
        </p>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  methods: {
    close() {
      this.$emit("close");
    },
  },
};
</script>

<style scoped lang='scss'>
.agreement {
  border-radius: 1em;
  height: 80vh;
  width: 80vw;
  display: flex;
  flex-direction: column;
  text-align: left;
  .close {
    text-align: right;
    .van-icon {
      margin: 0.5em 0.5em 0.5em 0;
      border: 1px solid #ff367c;
      border-radius: 50%;
      background: #ff367c;
      color: #fff;
      padding: 2px;
    }
  }
  .content {
    flex: 1;
    overflow: auto;
    .box {
      padding: 0 0.5em;
      padding-bottom: 1em;
      h3 {
        margin: 0;
        text-align: center;
      }
      h5 {
        margin: 0;
        font-size: 1em;
        padding: 1em 0 0.8em 0;
      }
      p {
        margin: 0;
        font-size: 0.85em;
        line-height: 1.6em;
      }
    }
  }
}
</style>